In [1]:
import requests
import pandas as pd
import matplotlib.pyplot as plt
from datetime import datetime

In [2]:
endpoint = 'https://data.nashville.gov/resource/fuaa-r5cm.json'

In [3]:
#response = requests.get(endpoint)

In [7]:
result = response.json()

In [8]:
#Make an API request that returns the months where "fire" was searched in 2016. 
#Which month had the most searches? 
params = {'query_text': 'fire', 
          'year': 2016
    }
response= requests.get(endpoint, params=params)
response.text

'[{"month_name":"January","year":"2016","query_count":"19","query_text":"fire"}\n,{"month_name":"February","year":"2016","query_count":"35","query_text":"fire"}\n,{"month_name":"March","year":"2016","query_count":"32","query_text":"fire"}\n,{"month_name":"April","year":"2016","query_count":"26","query_text":"fire"}\n,{"month_name":"May","year":"2016","query_count":"24","query_text":"fire"}\n,{"month_name":"June","year":"2016","query_count":"31","query_text":"fire"}\n,{"month_name":"July","year":"2016","query_count":"24","query_text":"fire"}\n,{"month_name":"August","year":"2016","query_count":"47","query_text":"fire"}\n,{"month_name":"September","year":"2016","query_count":"36","query_text":"fire"}\n,{"month_name":"October","year":"2016","query_count":"38","query_text":"fire"}\n,{"month_name":"November","year":"2016","query_count":"32","query_text":"fire"}\n,{"month_name":"December","year":"2016","query_count":"38","query_text":"fire"}]\n'

In [9]:
df_fire = pd.DataFrame(result)
df_fire.loc[df_fire['query_text'] =='fire']

   month_name  year query_count query_text
0     January  2016          19       fire
1    February  2016          35       fire
2       March  2016          32       fire
3       April  2016          26       fire
4         May  2016          24       fire
5        June  2016          31       fire
6        July  2016          24       fire
7      August  2016          47       fire
8   September  2016          36       fire
9     October  2016          38       fire
10   November  2016          32       fire
11   December  2016          38       fire

   month_name  year      query_text query_count
0     January  2014            ebid         223
1     January  2014   property maps         112
2     January  2014            maps          97
3     January  2014    property tax          90
4     January  2014            jobs          76
..        ...   ...             ...         ...
95    January  2014      zoning map          14
96    January  2014           email          14
97    January  2014  Property taxes          14
98    January  2014          budget          14
99    January  2014         traffic          14

[100 rows x 4 columns]

In [36]:
#Make an API request that returns all the times a query was run more than 100 times in a month. 
#How many times did this occur?  
aparams = {
    '$select': 'month_name, year, query_text, query_count',
    '$limit': '50000',
    '$where': 'query_count>=100',
     }
aresponse = requests.get(endpoint, params=aparams)
ares = aresponse.json()
response = pd.DataFrame(ares)
response['query_count'] = pd.to_numeric(response['query_count'])
api_request = response[response['query_count'] > 100]
occurrences_count = api_request.shape[0]
api_request.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1262 entries, 25 to 1286
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   month_name   1262 non-null   object
 1   year         1262 non-null   object
 2   query_text   1262 non-null   object
 3   query_count  1262 non-null   int64
dtypes: int64(1), object(3)
memory usage: 49.3+ KB

In [43]:
#Make another API request that returns all the times "codes" was searched more than 100 times in a month.
aparams = {
    '$select': 'query_text,month, query_count',
    '$q': 'codes',
    '$limit': '50000',
    '$where': 'query_count>=100',
     }
aresponse = requests.get(endpoint, params=aparams)
ares = aresponse.json()
codes_response = pd.DataFrame(ares)
codes_response['query_count'] = pd.to_numeric(codes_response['query_count'])
codes_api_request = codes_response[codes_response['query_count'] > 100]
codes_occurrences_count = codes_api_request.shape[0]
codes_api_request

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   query_text   58 non-null     object
 1   query_count  58 non-null     int64
 2   month        31 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.5+ KB

   query_text  query_count month
0       codes          115   NaN
1       codes          117   NaN
2       codes          101   NaN
3       codes          121   NaN
4       codes          111   NaN
5       codes          107   NaN
6       codes          104   NaN
7       codes          150   NaN
8       codes          158   NaN
9       codes          190   NaN
10      codes          269   NaN
11      codes          192   NaN
12      codes          215   NaN
13      codes          222   NaN
14      codes          168   NaN
15      codes          206   NaN
16      codes          138   NaN
17      codes          106   NaN
18      codes          185   NaN
19      codes          170   NaN
20      codes          183   NaN
21      codes          204   NaN
22      codes          166   NaN
23      codes          225   NaN
24      codes          171   NaN
25      codes          174   NaN
26      codes          201   NaN
27      codes          129     1
28      codes          124     2
29      codes          133     3
30      codes          168     4
31      Codes          174     5
32      codes          125     6
33      codes          161     7
34      codes          156     8
35      codes          126     9
36      codes          159    10
37      codes          134    11
38      codes          143    12
39      codes          161     1
40      codes          164     3
41      codes          181     2
42      codes          184     5
43      Codes          183     4
44      codes          164     7
45      codes          208     6
46      codes          130     9
47      codes          178     8
48      codes          139    10
49      codes          104    11
50      codes          165    12
51      codes          191     1
52      codes          131     2
53      codes          134     3
54      codes          102     4
55      codes          115     5
56      codes          138     6
57      codes          114     7

In [45]:
#How many times did this occur?, 58 entries 
codes_api_request.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 58 entries, 0 to 57
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   query_text   58 non-null     object
 1   query_count  58 non-null     int64
 2   month        31 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.5+ KB

In [33]:
#Make an API request that returns the entire Top 500 Monthly Searches dataset. 
#Make a chart that shows the number of times "maps" was searched in a month across the entire time frame.
aparams = {
    '$select': 'month_name, year, query_text, query_count',
    '$limit': '50000'
    }
aresponse= requests.get(endpoint, params=aparams)
ares=aresponse.json()
response=pd.DataFrame(ares)
response

      month_name  year         query_text query_count
0        January  2014               ebid         223
1        January  2014      property maps         112
2        January  2014               maps          97
3        January  2014       property tax          90
4        January  2014               jobs          76
...          ...   ...                ...         ...
43672       July  2021     sign ordinance           8
43673       July  2021               snap           8
43674       July  2021     small business           8
43675       July  2021   water department           8
43676       July  2021  value of property           8

[43677 rows x 4 columns]